Repository: denis-aka-wolf/fundingrate
Catalog: lib/l10n/intl_*.arb
Languages: ru

# welcomeMessage
source: Welcome! I will notify you about high funding rates.
ru: Добро пожаловать! Я буду уведомлять вас о высоких ставках финансирования.

# welcomeBackMessage
source: Welcome back!
ru: С возвращением!

# settingsNotFound
source: Settings not found. Please use /start to initialize your settings.
ru: Настройки не найдены. Пожалуйста, используйте /start для инициализации.

# botStatus
source: Bot is running.
ru: Бот запущен.

# languageChanged
source: Language changed to {lang}
ru: Язык изменен на {lang}

source: Unsupported language.
ru: Неподдерживаемый язык.

# langUsage
source: Usage: /lang <language_code>
ru: Использование: /lang <код_языка>

source: Funding rate threshold updated.
ru: Порог ставки финансирования обновлен.

# fundingRateThresholdUsage
source: Usage: /set_funding_rate_threshold <value>
ru: Использование: /set_funding_rate_threshold <значение>

source: Minutes before expiration updated.
ru: Количество минут до истечения срока обновлено.

# minutesBeforeExpirationUsage
source: Usage: /set_minutes_before_expiration <value>
ru: Использование: /set_minutes_before_expiration <значение>

# fundingRateAlert
source: High funding rate for {symbol}: {fundingRate}
ru: Высокая ставка финансирования для {symbol}: {fundingRate}

source: Access denied.
ru: Доступ запрещен.

# userPromotedToAdmin
source: User {userId} is now an admin.
ru: Пользователь {userId} теперь администратор.

# userPromotedToModerator
source: User {userId} is now a moderator.
ru: Пользователь {userId} теперь модератор.

# userDemotedFromAdmin
source: User {userId} is no longer an admin.
ru: Пользователь {userId} больше не администратор.

# userDemotedFromModerator
source: User {userId} is no longer a moderator.
ru: Пользователь {userId} больше не модератор.

# specifyUser
source: Please specify a user ID or reply to a message.
ru: Пожалуйста, укажите ID пользователя или ответьте на сообщение.

# adminsList
source: Admins: {userIds}
ru: Администраторы: {userIds}

# moderatorsList
source: Moderators: {userIds}
ru: Модераторы: {userIds}

# setUsage
source: Usage: /set <KEY> <VALUE>
ru: Использование: /set <KEY> <VALUE>

# welcomeMessageDetailed
source: Hello! I am a bot that tracks funding rates for various cryptocurrency pairs on Bybit. I can notify you when rates exceed a specified threshold.
ru: Привет! Я бот, который отслеживает ставки финансирования для различных криптовалютных пар на Binance. Я могу уведомлять вас, когда ставки превышают заданный порог.

source: Available commands:
ru: Доступные команды:

# userCommands
source: - /start - Start the bot - /settings - View current settings - /status - Check bot status - /lang <language_code> - Change language - /set_funding_rate_threshold <value> - Set funding rate threshold - /set_minutes_before_expiration <value> - Set minutes before expiration
ru: - /start - начать работу с ботом - /settings - посмотреть текущие настройки - /status - проверить статус бота - /lang <language_code> - изменить язык - /set_funding_rate_threshold <value> - установить порог ставки финансирования - /set_minutes_before_expiration <value> - установить количество минут до истечения срока

# adminCommands
source: - /add_admin <user_id> - Promote user to admin - /add_moderator <user_id> - Promote user to moderator - /del_admin <user_id> - Demote user from admin - /del_moderator <user_id> - Demote user from moderator - /users_admin - List all admins - /users_moderator - List all moderators
ru: - /add_admin <user_id> - назначить пользователя администратором - /add_moderator <user_id> - назначить пользователя модератором - /del_admin <user_id> - лишить пользователя прав администратора - /del_moderator <user_id> - лишить пользователя прав модератора - /users_admin - список всех администраторов - /users_moderator - список всех модераторов

# moderatorCommands
source: - /settings_app - Show current application settings - /set <parameter> <value> - Change application setting
ru: - /settings_app - показать текущие настройки приложения - /set <parameter> <value> - изменить настройку приложения
